
x = float(input("Введіть координату x: "))
y = float(input("Введіть координату y: "))

if x == 0 and y == 0:
    print("Точка знаходиться в центрі координат.")
else:
    if x == 0:
        print("Точка лежить на осі Y.")
    else:
        if y == 0:
            print("Точка лежить на осі X.")
        else:
            if x > 0 and y > 0:
                print("Точка знаходиться в першому квадранті.")
            else:
                if x < 0 and y > 0:
                    print("Точка знаходиться в другому квадранті.")
                else:
                    if x < 0 and y < 0:
                        print("Точка знаходиться в третьому квадранті.")
                    else:
                        print("Точка знаходиться в четвертому квадранті.")
